// серіалізація це спосіб переведення в даних в однорідний формат (байти, текст)
// десеріалізаця це повернення даних з однорідного формату в приклад за даними

// цей механізм потрібен для передаці даних між сервісами навіть в одній машині
// для того щоб зберігати дані
// для того щоб виводити їх у консоль

const obj = {
  a: 1,
  b: 2,
  c: '3'
}; // це якісь типові дані в javaascript 
// вони мають сенс лише у javascript

// в нашому випадку можна сеарелізвати дані в рядок, для цього є спеціальний інструмент

const string = JSON.stringify(obj); // він перетворить дані в рядок
// таким чином що їх тепер можна зберігати і передавати
console.log(string);

// pro tip, для того щоб виглядало красивіше можна передати ще два аргументи

console.log(JSON.stringify(obj, null, 4));

// з іншого боку якщо ви отримуєте ці дані то їх потрібно розшифрувати назад у javascript формат
// для цього у об'єкта JSON є інший метод

console.log(JSON.parse(obj));

// після десеріалізація об'єкт більше не має прототипів окрім "рідного"
// він перестає бути классом і втрачає інші приналежності
