window // це об'єкт який буде зберігати змінні, функції
// та інші об'єкти у глобальній області видимості можна навіть
// сказати що глобальна область видимості це і є window

var globalVar1 = 'easy';
function doJavaScripHaveFun () {} // medium also

console.log('Змінна var', globalVar1, window.globalVar1);
console.log('функція', doJavaScripHaveFun, window.doJavaScripHaveFun);

// якщо змінна не знаходится у глобальній області видимості
// її туди можна спеціально покласти, для того щоб використовувати
// у будь якому місці вашої программи


globalVar4 = 'hard'; // hard якщо спробувати просто назначити невідому змінну
// вона буде призначена у глобальну зону видимості
window.globalVar5 = 'hard'; // hard

// якщо ви спробуєте використати змінну якої немає у глобальній області
// отримаєте помилку

// console.log(asdfg); // розмомментуй щоб перевірити

// щоб такого уникнути можна "аккуратно" перевірити її наявність
// як я і казав що всі змінні у глобальній області видимості
// знаходяться у глобальному об'єкті window як його властивості

console.log(window.asdfg); // undefined - бо такої немає
console.log(window.globalVar2); // medium - чудово