// творіть функцію що отримує масив чисел 
// і обчисляє середнє значення
// функція отримує один аргумент - массив
// повертає числове значення (середнє)

const reduceArray = // ваш код

// створіть функцію що може порівняти 2 об'єкта
// і відповісти напевне чи відповідають
// усі властивості об'єкту А об'єкту Б
// якщо усі властивості збігаються треба повернути true інакше false
// порівнюйте властивості строго

const compareObjects = // ваш код

// створіть функцію що порівнює два массиви
// якщо всі елементи співпадають (на всіх індексах відповідно)
// поверніть true
// функція приймає два аргументи і повертає булівське значення

const compareArrays = // ваш код