// у javascript є спосіб створювати функцію лише з тексту

const text = 'let a = 1;'
  + 'a += 12;'
  + 'console.log(a);'; // збираємо текст який хочемо перетворити в javascript

console.log('текст який буде виконано: ', text);

// для того щоб цей текст перетворився в код, йому треба проти деякий етап інтерпритації
// зі точки зору javascript - це процес передання на інший рівень
// і виглядає це так

const func = new Function(text);

// коли ми викличему цю функцію то текст буде запущений

func();

// позитивний момент такого виконання - це те що ваш текст не користується середовищем
// ні вашими зовнішіми змінними, але не глобальними (var, window);

const a = 1;

const func1 = new Function('console.log(a);');

// func1(); // буде ламатися з помилкою

// ще одна цікава особливість - це те що можна називати аргументи функції
// так як наприклад function(a) {}
// і використовувати їх пізніше всередині
const func2 = new Function('a', 'console.log(a);');

func2(1);