// в якись момент життя javascript програмування сильно змінилось
// рушієм для цих змін став величезний попит на web і ціленаправлені
// зміни у браузерах які вже відбулися тільки підштовхнули цей процесс
// коротше

// деякі з них ви вже використовуєте

const a = 1; // константи
let b = 2; // безпечні змінні
const func = () => {}; // лямбда функції
class MyOwnError extends Error {} // явні класи і наслідування

for (const a in [1,2,3]) {} // цикли for in (перебір по ключам)
for (const s of [3,2,1]) {} // цикли for of (перебір по значенням)

// деякі ще не скоро доведеться використати

{
  b += a;
  b = 12;
  func();
  new MyOwnError();
} // блочний вираз

function* a () { // функції генератори
  yield 1; // і їхні ітератори
}

new AudioContext(); // аудіо інстременти браузера

// ми сконцкнтруємося лише на тих (значимих) властивостях які значно полегшать вам життя