// коли ви пройшли дз минулого уроку у вас могло виникнути логічне питання
// якщо рядок це будь які символи в кавичках, то мабуть і кавички в кавичках це теж рядок...
// чи як це взагалі працює

var legal = '"Дійсьно дужки в дужках"' + "'ну і так теж ніхто не забороняв'";
// var illegal = ''а це вже зовсім не те чим здаєтся, два окремих рядка один за одинм, ще й без оператора чи відокремлення''

// натомість був придуманий механізм інтерполяції (екранування) де можна деякі символи просто приховати від інтерпритатора

legal = '\'Ну от ми вже в якісь сірій зоні\'';
// Та зовсім ні, це нормальний механізм, якщо поставити символ "\" перед кавичкою то інтерпритатор інакше сприймає наступний символ
