// у рядкуів і масивів чудові відносини
// обидва стандартні індексовані типи
// у обох є додаткові методи щоб перетворювате
// одне у інше

const array = [1,2,3,4,5,6];
const string = 'Hello world';

// масив можна перетворити в рядок з'єднавши усі його елементи
console.log(array.join());
// метод join приймає 1 аргумент який визначає "чим" будуть з'єднані між собою його елементи
// якщо аргументу не буде, то стандартно це просто кома
console.log(array.join(''));
console.log(array.join('-'));
console.log(array.join(' ... '));

// рядок можна легко перетворити у масив, для цього нього існує метод розділити (split)
console.log(string.split());
// метод split приймає один аргумент - рядок, це може бути символ чи декілька
// цей символ розділить рядок на елементи, наприклад ми можемо розділити слова знаком пробіл
console.log(string.split(' '));
console.log(string.split('w'));
console.log(string.split('Hello'));
// якщо аргументу не було передано то кожен символ в рядку стане елементом масиву

// у масиву є метод reverse який обертає масив
// так можна обернути і рядок якщо перетворити його у масив і назад

console.log(string.split().reverse().join(''));
console.log(string.split(' ').reverse().join(' ')); // міняємо порядок слів