// цикли це спосіб використати код багато разів
// існує декілька видів циклів, але їхні відмінності не принципові
// вони дуже нагадують одне одного анатомічно
// міняются лише їх призначення 

// for цикл рахує скільки разів йому потрібно виконатись

for (let i = 0; i < 10; i += 1) { // виконаєтся 10 разів
  console.log('for iteration', i + 1); // одне виконання будь якого в циклі називається ітерація
}

for (let i = 9; i < 10; i += 1) { // виконаєтся 1 раз
  console.log('for 2 ieteration', i + 1);
}

// while цикл буде виконуватися стільки разів скільки потрібно поки умова не стане false

let condition = true;
let counter = 1;

while (condition) {
  console.log('while iteration', counter);
  condition = (Math.random() * 10) >= 9; // буде виконуватись поки значення не сягне дев'яти
  counter++;
}

// do while цикл ідентичний while окрім того що умова do має виконатись хоча б один раз

let value;
let con;

do {
  value = (Math.random() * 10)
  con = value > 5; // 50/50
  console.log('do-while iteration', value);
} while (con);

// з циклу можна вийти 3-ма способами

// якщо умова в круглих дужках каже що пора
// дивіться приклади вище

// у будь якому циклі можна написати ключове слоко break;
// і він відразу припинить виконуватись, код після циклу буде виконуватись

while (true) {
  console.log('Фух, майже попали у безкінечний цикл');
  break;
}

// якщо він у функції можна використати return це припинить функцію в цілому

const find = (array, value) => {
  for (let i = 0; i < array.length; i++) { // буде виконуватись стільки разів скільки є елементів у масиві
    if (array[i] === value) return i; 
  }

  return null;
}

console.log(find([1,2,3,4], 1));
console.log(find([1,2,3,4], 12));
console.log(find([1,2,3,4], 4));

// код припиняєтся коли доходить до помилки

while (true) {
  throw new Error('Ти хотів написати безкінечний цикл, але я тобі цього не дам зробити');
}