// найскладніший з усіх циклів

// в круглих дужках циклу for має бути три вирази розділені крапка комою
// 1 - вираз що виконаєтся до старту циклу
// 2 - вираз що буде вирішувати чи потрібно запускати циклу
// 3 - вираз що буде виконуватися після кожного запуску циклу

// ось вони

// 1 - оголоження змінної i, присвоєння їй значення 0
// 2 - перевірка чи змінна i зягнула значення 10
// 3 - збільшення значення i

for (let i = 0; i < 10; i = i + 1) {
  console.log('will run one time');
  break;
}

// обов'яковим є лише другий вираз

for (;true;) {
  console.log('Обережно безкінечний цикл');
  break;
}

let i = 0; // чи має сенс тримати змінну не в тіли циклу, можливо

for (;i < 10;) {
  console.log('iteration', i);
  i++; // просто збільшує на одиницю
}

console.log(i); // i яка не в циклі вже значення 10, шкідливо

for (let i = 0;i < 10;) {
  console.log('iteration', i);
  i++; // якщо забудем написати i ніколи не сягне значення 10
}
