// напишіть функцію яка буде створю вати об'єкт базуючись на аргументах
function createAnimal(type, name) {
  // ваш код
}

// напишіть функцію яка буде оминати елемент у масиві
// вона має перебирати масив у пошуках значення
// у випадку його відсутності повертає недоторканий масив
// значень у масиві декілька, прибрати потрібно всі
const array = [1,2, 12, null, NaN, 1.1, '1']
function omit(array, element) {
  const newArray = [];
  // ваш код...
  // newArray[i] = v;

  return newArray;
};

// напишіть функцію яка буде перетворювати кожен елемент масиву у число
const transformToString = (array) => {
  // ваш код
};

// напишіть функцію яка приймає об'єкт і повертає виключно його значення у масиві

const obj = {
  a: 1,
  b: 2,
  c: null,
  d: 'Hello world',
};
const objectToArray = (object) => {
  const keys = Object.keys(object); // масив ключів об'єкта

  // ваш код
}

