// якщо виходити з твердження що все в javascript - це об'єкт 
// це означає що в будь якого об'єкту є свій конструктор

Number // конструктор для чисел
String // конструктор для рядків
Array  // конструктор для масивів

Object // конструктор для всього

Object.prototype.doDido = 'ok Bob';

console.log(1..doDido);
console.log(true.doDido);
console.log('a'.doDido);

// якщо у классу Object є прототип який є у всього
// то він впливає на все глобально і все наслідується від нього
// в javascript все об'єкт

// у javascript можна в якості прототипу назначати готовий об'єкт
// спочатку підіб'ємо під наші потреби об'єкт

const proto = {
	a: 1,
	b: '2'
};

// і назначимо його як прототип

const obj = Object.create(proto);

console.log(obj.a, obj.b);
// таким чином ми надаємо новому об'єкту існуючий прототип (його конструктор все одно Object)
// по суті це аналог створення класу