// створіть функцію що створює кнопку у документі
// яка буде рахувати скільки її натиснули
// функція не приймає аргументів і нічого не повертає
// але після її виклику в документі з'являєтся кнопка
// ця кнопка буде показувати точну кількість разів які її натиснули
// не використовуйте змінних у глобальній області видимості

const createCounter = () => {
  
}

// створіть простий годинник
// все що він буде робити це показувати час (не обов'язково правильний)
// він має з'явитися на сторінці і працювати як цифровий годинник
// формат часу буде HH:MM:SS години хвилини секунди
// для DOM елементу використовуйте document.createElement('div')
// функція нічого не приймає і нічого не повертає
// після її виклику на сторінці з'являєтся вже працюючий годинник

const generateClock = () => {

};
